#  Натуральные числа, содержащие хотя бы одну цифру, введенную с клавиатуры. Данную цифру выводить прописью.
import re

slovar = {'0': 'ноль', '1': 'один', '2': 'два', '3': 'три', '4': 'четыре', '5': 'пять', '6': 'шесть', '7': 'семь',
          '8': 'восемь', '9': 'девять'}


def num_to_text(number):
    return slovar[number]


# -----------------------Введение проверочных цифр-----------------------

control_num = str(input('Введите цифру: '))
print('-------')

# -----------------------Введение проверяемых чисел---------------------

with open('data_list.txt', 'r') as f:
    lines = f.readlines()
    data = ' '
    for i in lines:
        data += i
    data += ' '

# --------------------------Форматирование данных------------------------

try:
    data = re.sub(control_num, num_to_text(control_num), re.sub('\s[^' + re.escape(control_num) + '\s]{1,}\s', '', re.sub('\s', '  ', re.sub('\d*[^\d\s]\S*\s', '', data))))
    # ----------------------------------Вывод-------------------------------
    if re.sub('\s', '', data) != '':
        answer = data.split()
        for text in answer:
            print(text)
    else:
        print('В файле отсутсвуют подходящие числа или чисел нет вовсе')
except KeyError:
    print('Ошибка: Введена не цифра, введите одно натуральное число')

